import bd
from random import randint, choice

first_name = ["Павел", "Никита", "Михаил", "Алексей", "Дмитрий", "Аркадий", "Евгений", "Сергей", "Антон", "Александр"]
second_name = ["Кудрявцев", "Шестаков", "Колыванов", "Колесников",
               "Аксенов", "Бунин", "Захаров", "Улитин", "Зыков", "Тиньков"]
city = ["Лысьва", "Екатеринбург", "Новокузнецк", "Москва", "Курск", "Санкт-Петербург",
        "Волгоград", "Сочи", "Анапа", "Лондон"]
street = ["ул. Умельцев", "ул. Оборина", "ул. Быстрых", "ул. Советская", "ул. Мира", "ул. Победы",
        "ул. 8 марта", "ул. Белинского", "ул. Краснолесье", "ул. Бардина"]

for i in range(1, 20):
    name = choice(first_name) + " " + choice(second_name)
    address = choice(city) + ", " + choice(street) + ", д. " + str(randint(1, 100))
    bd.add_customer(name, address)